import { Container } from "@mui/material";

function Home() {
  return (
    <div>
      <Container  maxWidth="md">
        <h1 style={{ textAlign: "center" }}>ระบบบันทึกรายละเอียดห้อง</h1>
        <h4><u>Requirements</u> (ระบบบันทึกรายละเอียดห้อง)</h4>
        <p>
        ระบบจองใช้ห้องของบริษัท Room Booking เป็นระบบที่มีแค่สมาชิกระบบจองใช้ห้องเท่านั้นที่สามารถจองได้ โดย login เข้ามาเพื่อเลือกห้องที่ต้องการจอง ระบบจะแสดงข้อมูลเกี่ยวกับห้องเพื่อช่วยในการตัดสินใจ เมื่อยืนยันการจองแล้วสมาชิกสามารถทำการยืมอุปกรณ์และสั่งอาหารว่างได้ โดยจะประกอบด้วยระบบหลักๆดังนี้ ระบบบันทึกการจองใช้ห้อง ระบบชำระเงินที่ใช้ในการจองห้อง ระบบยืมอุปกรณ์ ระบบสมัครสมาชิก ระบบบันทึกข้อมูลอุปกรณ์ ระบบบันทึกการสั่งอาหารว่าง ระบบบันทึกรายละเอียดห้อง
        </p>
        <p>
        ระบบบันทึกรายละเอียดห้อง เป็นระบบที่ให้พนักงานระบบจองห้องต้อง  Log in ทำการบันทึกข้อมูลของห้อง เพื่อให้สมาชิกระบบจองใช้ห้องสามารถจองห้องต่าง ๆ ได้ โดยพนักงานระบบจองห้องจะบันทึกรายละเอียดเกี่ยวกับห้อง เช่น หมายเลขห้อง, ชื่อห้อง, ช่วงเวลาที่เปิดใช้งานห้อง, ประเภทห้อง, อาคารของห้องนั้นๆ, วันที่เปิดใช้งานห้อง
        </p>
        <br />
        <h4><u>User Story</u> (ระบบบันทึกรายละเอียดห้อง)</h4>
        <p> 
          <b>ในบทบาทของ</b>	พนักงานระบบ<br />
          <b>ฉันต้องการ</b>	บันทึกรายละเอียดของห้อง<br />
          <b>เพื่อ</b>	ให้สมาชิกระบบจองใช้ห้องสามารถดูรายละเอียดของห้องเพื่อทำการจองได้<br />
        </p>
      </Container>

    </div>
  );
}
export default Home;